In [1]:
import numpy as np

In [2]:
import pandas as pd

In [209]:
stdData = {
    'Math':[23,45,67,89,56],
    'Physic':[13,88,95,34,77],
    'Chemistry':[45,34,55,78,69],
}
std = ["Nasir",'Mansoor','Kashan','imad','Shifa']
stdframe = pd.DataFrame(stdData,index=std)

In [210]:
stdframe

         Math  Physic  Chemistry
Nasir      23      13         45
Mansoor    45      88         34
Kashan     67      95         55
imad       89      34         78
Shifa      56      77         69

In [211]:
stdframe['Total'] = stdframe['Math'] + stdframe['Physic'] + stdframe['Chemistry']

In [212]:
stdframe['Percentage'] = stdframe['Total']/3*100

In [213]:
stdframe['Percentages'] = [str(i)+"%" for i in stdframe['Percentage']]

In [214]:
stdframe

         Math  Physic  Chemistry  Total   Percentage         Percentages
Nasir      23      13         45     81  2700.000000             2700.0%
Mansoor    45      88         34    167  5566.666667  5566.666666666666%
Kashan     67      95         55    217  7233.333333  7233.333333333333%
imad       89      34         78    201  6700.000000             6700.0%
Shifa      56      77         69    202  6733.333333  6733.333333333333%

In [215]:
stdframe['Remarks'] = ['Pass' if m >= 33 and p >= 33 and c >= 33 else 'Fail' for m,p,c in zip1]

In [216]:
stdframe

,Math,Physic,Chemistry,Total,Percentage,Percentages,Remarks
Nasir,23,13,45,81,2700.000000,2700.0%,Fail
Mansoor,45,88,34,167,5566.666667,5566.666666666666%,Pass
Kashan,67,95,55,217,7233.333333,7233.333333333333%,Pass
imad,89,34,78,201,6700.000000,6700.0%,Pass
Shifa,56,77,69,202,6733.333333,6733.333333333333%,Pass

In [217]:
zip1 = zip(stdframe['Math'],stdframe['Physic'],stdframe['Chemistry'])

In [218]:
stdframe.T

,Nasir,Mansoor,Kashan,imad,Shifa
Math,23,45,67,89,56
Physic,13,88,95,34,77
Chemistry,45,34,55,78,69
Total,81,167,217,201,202
Percentage,2700,5566.67,7233.33,6700,6733.33
Percentages,2700.0%,5566.666666666666%,7233.333333333333%,6700.0%,6733.333333333333%
Remarks,Fail,Pass,Pass,Pass,Pass

In [219]:
stdframe

,Math,Physic,Chemistry,Total,Percentage,Percentages,Remarks
Nasir,23,13,45,81,2700.000000,2700.0%,Fail
Mansoor,45,88,34,167,5566.666667,5566.666666666666%,Pass
Kashan,67,95,55,217,7233.333333,7233.333333333333%,Pass
imad,89,34,78,201,6700.000000,6700.0%,Pass
Shifa,56,77,69,202,6733.333333,6733.333333333333%,Pass

In [220]:
print(stdframe.index)

Index(['Nasir', 'Mansoor', 'Kashan', 'imad', 'Shifa'], dtype='object')

In [221]:
print(stdframe.columns)

Index(['Math', 'Physic', 'Chemistry', 'Total', 'Percentage', 'Percentages',
       'Remarks'],
      dtype='object')

In [222]:
# apnay Index ka name change kar salty han/""

In [223]:
stdframe.index.name = 'Student Data'

In [224]:
print(stdframe.index)

Index(['Nasir', 'Mansoor', 'Kashan', 'imad', 'Shifa'], dtype='object', name='Student Data')

In [225]:
'Math' in stdframe

True

In [226]:
stdframe.Math

Student Data
Nasir      23
Mansoor    45
Kashan     67
imad       89
Shifa      56
Name: Math, dtype: int64

In [227]:
stdData = {'Computer Science':[45,45,54,45,45]}
stdframe = pd.DataFrame(stdData,index=std)

In [228]:
stdframe

         Computer Science
Nasir                  45
Mansoor                45
Kashan                 54
imad                   45
Shifa                  45

In [229]:
stdframe['Computer Science']

Nasir      45
Mansoor    45
Kashan     54
imad       45
Shifa      45
Name: Computer Science, dtype: int64

In [230]:
obj3 = pd.Series(['Blue','purple','Yellow'],index = [0,2,4])

In [231]:
obj3.reindex(range(6),method='ffill') # ya dekhyn foward fill karde values

0      Blue
1      Blue
2    purple
3    purple
4    Yellow
5    Yellow
dtype: object

In [232]:
frame = pd.DataFrame(np.arange(100).reshape((20,5)),
                     columns=['Ohio','Texas','California','abc','abc'])

In [233]:
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
1      5      6           7    8    9
2     10     11          12   13   14
3     15     16          17   18   19
4     20     21          22   23   24
5     25     26          27   28   29
6     30     31          32   33   34
7     35     36          37   38   39
8     40     41          42   43   44
9     45     46          47   48   49
10    50     51          52   53   54
11    55     56          57   58   59
12    60     61          62   63   64
13    65     66          67   68   69
14    70     71          72   73   74
15    75     76          77   78   79
16    80     81          82   83   84
17    85     86          87   88   89
18    90     91          92   93   94
19    95     96          97   98   99

In [234]:
stdframe.loc['Mansoor'] # ya string sa name du ga tu ya print karay ga

Computer Science    45
Name: Mansoor, dtype: int64

In [235]:
 stdframe.iloc[4] # ya number vise index uthta han

Computer Science    45
Name: Shifa, dtype: int64

In [236]:
obj = pd.Series([1,2,3,np.nan,'Null'],index=['a','b','c','d','e'])

In [237]:
obj

a       1
b       2
c       3
d     NaN
e    Null
dtype: object

In [238]:
stdframe

         Computer Science
Nasir                  45
Mansoor                45
Kashan                 54
imad                   45
Shifa                  45

In [239]:
are = np.arange(100).reshape(4,5,5)

In [240]:
are

array([[[ 0,  1,  2,  3,  4],
        [ 5,  6,  7,  8,  9],
        [10, 11, 12, 13, 14],
        [15, 16, 17, 18, 19],
        [20, 21, 22, 23, 24]],

       [[25, 26, 27, 28, 29],
        [30, 31, 32, 33, 34],
        [35, 36, 37, 38, 39],
        [40, 41, 42, 43, 44],
        [45, 46, 47, 48, 49]],

       [[50, 51, 52, 53, 54],
        [55, 56, 57, 58, 59],
        [60, 61, 62, 63, 64],
        [65, 66, 67, 68, 69],
        [70, 71, 72, 73, 74]],

       [[75, 76, 77, 78, 79],
        [80, 81, 82, 83, 84],
        [85, 86, 87, 88, 89],
        [90, 91, 92, 93, 94],
        [95, 96, 97, 98, 99]]])

In [241]:
f = lambda x: [x.max(),x.min(),x.sum()]
stdframe.apply(f,axis = 1)

Nasir      [45, 45, 45]
Mansoor    [45, 45, 45]
Kashan     [54, 54, 54]
imad       [45, 45, 45]
Shifa      [45, 45, 45]
dtype: object

In [242]:
f = lambda x: [x.max(),x.min(),x.sum()]
stdframe[['Math','Chemistry']].apply(f)

KeyError: "None of [Index(['Math', 'Chemistry'], dtype='object')] are in the [columns]"

In [243]:
stdframe

         Computer Science
Nasir                  45
Mansoor                45
Kashan                 54
imad                   45
Shifa                  45

In [244]:
format1 = lambda x:x**2
stdframe[['Math','Chemistry']].applymap(format1)

KeyError: "None of [Index(['Math', 'Chemistry'], dtype='object')] are in the [columns]"

In [245]:
format1 = lambda x:x**2
stdframe.applymap(format1)

         Computer Science
Nasir                2025
Mansoor              2025
Kashan               2916
imad                 2025
Shifa                2025

In [246]:
stdframe.sort_index()

         Computer Science
Kashan                 54
Mansoor                45
Nasir                  45
Shifa                  45
imad                   45

In [3]:
stdData = {
    'math': [23,45,67,89,56],
    'physics': [13,88,95,34,77],
    'chemistry': [45,34,55,78,67],
    'computer science': [45,34,55,78,67]
}
std = ['nasir','mansoor','kashan','imad','shifa']
stdFrame = pd.DataFrame(stdData, index=std)
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

In [4]:
stdFrame['Total'] = stdFrame['math'] + stdFrame['physics'] + stdFrame['chemistry'] + stdFrame['computer science']

In [5]:
stdFrame

         math  physics  chemistry  computer science  Total
nasir      23       13         45                45    126
mansoor    45       88         34                34    201
kashan     67       95         55                55    272
imad       89       34         78                78    279
shifa      56       77         67                67    267

In [6]:
stdFrame['Remarks'] = ["Pass" if i > 33 else "Fail"  for i in stdFrame['Total']]

In [7]:
stdFrame

         math  physics  chemistry  computer science  Total Remarks
nasir      23       13         45                45    126    Pass
mansoor    45       88         34                34    201    Pass
kashan     67       95         55                55    272    Pass
imad       89       34         78                78    279    Pass
shifa      56       77         67                67    267    Pass

In [8]:
stdFrame['Percentage'] = stdFrame["Total"] /300 * 100
stdFrame['Percentage'] = [str("{0:.1f}".format(i))+"%" for i in stdFrame['Percentage']]

In [9]:
stdFrame

         math  physics  chemistry  computer science  Total Remarks Percentage
nasir      23       13         45                45    126    Pass      42.0%
mansoor    45       88         34                34    201    Pass      67.0%
kashan     67       95         55                55    272    Pass      90.7%
imad       89       34         78                78    279    Pass      93.0%
shifa      56       77         67                67    267    Pass      89.0%

In [10]:
stdFrame.T # row ko column or column ko row

                  nasir mansoor kashan   imad  shifa
math                 23      45     67     89     56
physics              13      88     95     34     77
chemistry            45      34     55     78     67
computer science     45      34     55     78     67
Total               126     201    272    279    267
Remarks            Pass    Pass   Pass   Pass   Pass
Percentage        42.0%   67.0%  90.7%  93.0%  89.0%

In [11]:
print(stdFrame.columns)
print(stdFrame.index)

Index(['math', 'physics', 'chemistry', 'computer science', 'Total', 'Remarks',
       'Percentage'],
      dtype='object')
Index(['nasir', 'mansoor', 'kashan', 'imad', 'shifa'], dtype='object')

In [12]:
stdFrame.index.name = "Students"

In [13]:
stdFrame

          math  physics  chemistry  computer science  Total Remarks Percentage
Students
nasir       23       13         45                45    126    Pass      42.0%
mansoor     45       88         34                34    201    Pass      67.0%
kashan      67       95         55                55    272    Pass      90.7%
imad        89       34         78                78    279    Pass      93.0%
shifa       56       77         67                67    267    Pass      89.0%

In [14]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 8])
obj3

0      blue
2    purple
8    yellow
dtype: object

In [15]:
obj3.reindex(range(9), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    purple
5    purple
6    purple
7    purple
8    yellow
dtype: object

In [16]:
obj4 = pd.Series(["Sameer","Khan","Bhai","Shai"],index=[0,2,9,5])

In [17]:
obj4

0    Sameer
2      Khan
9      Bhai
5      Shai
dtype: object

In [18]:
obj4.reindex(range(5),method='ffill')

ValueError: index must be monotonic increasing or decreasing

In [ ]:
frame = pd.DataFrame(np.arange(100).reshape(20,5),index=range(1,100,5),columns=["Sameer","Khan","Bhai","Sasa","Bgi"])

In [ ]:
frame

In [ ]:
frame.loc['Sameer'] = [45,25,4,6,5]

In [ ]:
frame

In [ ]:
frame.iloc[0:10]

In [ ]:
frame.iloc['Sameer':'Sasa']

In [ ]:
obj9 = pd.Series([12,45,6,5,35])

In [ ]:
obj9

In [ ]:
obj9.values

In [ ]:
obj9 = pd.Series([12,45,6,5,35],index=['a','c','d','f','k'])

In [ ]:
obj9

In [ ]:
obj9[['a','d','f']]

In [ ]:
obj9['a']

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [23]:
obj4 = pd.Series(sdata, index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj4.name = "Poplation"

In [32]:
obj4.index.name = "States"

In [33]:
obj4

States
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Poplation, dtype: float64

In [34]:
frame = pd.DataFrame(np.arange(100).reshape(20,5),index=range(0,100,5),
                    columns=['Ohio', 'Texas', 'California', 'abc','abc'])

In [35]:
frame

    Ohio  Texas  California  abc  abc
0      0      1           2    3    4
5      5      6           7    8    9
10    10     11          12   13   14
15    15     16          17   18   19
20    20     21          22   23   24
25    25     26          27   28   29
30    30     31          32   33   34
35    35     36          37   38   39
40    40     41          42   43   44
45    45     46          47   48   49
50    50     51          52   53   54
55    55     56          57   58   59
60    60     61          62   63   64
65    65     66          67   68   69
70    70     71          72   73   74
75    75     76          77   78   79
80    80     81          82   83   84
85    85     86          87   88   89
90    90     91          92   93   94
95    95     96          97   98   99

In [36]:
frame[0:2]

   Ohio  Texas  California  abc  abc
0     0      1           2    3    4
5     5      6           7    8    9

In [38]:
frame["nasir":"kashan"]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.range.RangeIndex'> with these indexers [nasir] of <class 'str'>

In [39]:
stdFrame.loc['nasir':'kashan']

          math  physics  chemistry  computer science  Total Remarks Percentage
Students
nasir       23       13         45                45    126    Pass      42.0%
mansoor     45       88         34                34    201    Pass      67.0%
kashan      67       95         55                55    272    Pass      90.7%

In [40]:
obj = pd.Series([1,2,3,np.nan,7],index=['a','b','c','d','f'])

In [41]:
obj

a    1.0
b    2.0
c    3.0
d    NaN
f    7.0
dtype: float64

In [42]:
new_obj = obj.drop('c')

In [43]:
new_obj

a    1.0
b    2.0
d    NaN
f    7.0
dtype: float64

In [46]:
obj = obj.fillna(3) # fill nan ya karta han jitne be nan value han usko fill kar deta han

In [45]:
obj

a    1.0
b    2.0
c    3.0
d    3.0
f    7.0
dtype: float64

In [47]:
stdFrame[['physics','math']]

          physics  math
Students
nasir          13    23
mansoor        88    45
kashan         95    67
imad           34    89
shifa          77    56

In [49]:
stdFrame[(stdFrame['physics'] > 60) | (stdFrame['math'] > 50)]

          math  physics  chemistry  computer science  Total Remarks Percentage
Students
mansoor     45       88         34                34    201    Pass      67.0%
kashan      67       95         55                55    272    Pass      90.7%
imad        89       34         78                78    279    Pass      93.0%
shifa       56       77         67                67    267    Pass      89.0%

In [50]:
stdData = {
    'math': [23,45,67,89,56],
    'physics': [13,88,95,34,77],
    'chemistry': [45,34,55,78,67],
    'computer science': [45,34,55,78,67]
}
std = ['nasir','mansoor','kashan','imad','shifa']
stdFrame = pd.DataFrame(stdData, index=std)
stdFrame

         math  physics  chemistry  computer science
nasir      23       13         45                45
mansoor    45       88         34                34
kashan     67       95         55                55
imad       89       34         78                78
shifa      56       77         67                67

# stdFrame.where(stdFrame < 33,"Pass", inplace=True)

In [59]:
stdFrame.loc['nasir',['math','chemistry']]

math         23
chemistry    45
Name: nasir, dtype: int64

In [57]:
stdFrame.loc[::-1,::-1]

         computer science  chemistry  physics  math
shifa                  67         67       77    56
imad                   78         78       34    89
kashan                 55         55       95    67
mansoor                34         34       88    45
nasir                  45         45       13    23

In [77]:
f = lambda x:x.min() + x.max()

In [78]:
stdFrame[['math','physics']].apply(f) # ya dekhyn is nai + kar deya math kae or physic kae jitna be number thay

math       112
physics    108
dtype: int64

In [68]:
stdFrame.apply(f)

math                112
physics             108
chemistry           112
computer science    112
dtype: int64

In [71]:
stdFrame.apply(f,axis=1)

nasir       58
mansoor    122
kashan     150
imad       123
shifa      133
dtype: int64

In [84]:
format1 = lambda x: x**2
stdFrame[['math','physics']].applymap(format1)

         math  physics
nasir     529      169
mansoor  2025     7744
kashan   4489     9025
imad     7921     1156
shifa    3136     5929

In [82]:
# Apply jo han any aixes of the dataframe mtlb ya apply jo han row ya phir column walay axis par kaam karta han

In [83]:
# Or Applymap ya kaam karta ha har dataframe kae element par

In [86]:
f2 = lambda x: np.square(x)
stdFrame['math'].map(f2) # map function jiki sub sa chotii value hotii han wo phlay a jatii han

nasir       529
mansoor    2025
kashan     4489
imad       7921
shifa      3136
Name: math, dtype: int64